Duuang/Recorder-and-Player-Application-on-CC3200/CC3200 Project/main.c
	// Remove all profiles
	lRetVal = sl_WlanProfileDel(0xFF);
	ASSERT_ON_ERROR(lRetVal);



	//
	// Device in station-mode. Disconnect previous connection if any
	// The function returns 0 if 'Disconnected done', negative number if already
	// disconnected Wait for 'disconnection' event if 0 is returned, Ignore
	// other return-codes
	//
	lRetVal = sl_WlanDisconnect();
	if(0 == lRetVal)
	{
		// Wait
		while(IS_CONNECTED(g_ulStatus))
		{
#ifndef SL_PLATFORM_MULTI_THREADED
			_SlNonOsMainLoopTask();
#endif
		}
	}

	// Enable DHCP client
	lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
	ASSERT_ON_ERROR(lRetVal);

	// Disable scan
	ucConfigOpt = SL_SCAN_POLICY(0);
	lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Set Tx power level for station mode
	// Number between 0-15, as dB offset from max power - 0 will set max power
	ucPower = 0;
	lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
			WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
	ASSERT_ON_ERROR(lRetVal);

	// Set PM policy to normal
	lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Unregister mDNS services
	lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Remove  all 64 filters (8*8)
	memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
	lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *)&RxFilterIdMask,
			sizeof(_WlanRxFilterOperationCommandBuff_t));
	ASSERT_ON_ERROR(lRetVal);

	lRetVal = sl_Stop(SL_STOP_TIMEOUT);
	ASSERT_ON_ERROR(lRetVal);

	InitializeAppVariables();

	return lRetVal; // Success
}



//****************************************************************************
//
//! Confgiures the mode in which the device will work
//!
//! \param iMode is the current mode of the device
//!
//! This function
//!    1. prompt user for desired configuration and accordingly configure the
//!          networking mode(STA or AP).
//!       2. also give the user the option to configure the ssid name in case of
//!       AP mode.
//!
//! \return sl_start return value(int).
//
//****************************************************************************
static int ConfigureMode(int iMode)
{

	long   lRetVal = -1;

	//	UART_PRINT("Enter the AP SSID name: ");
	//	GetSsidName(pcSsidName,33);

	lRetVal = sl_WlanSetMode(ROLE_AP);
	ASSERT_ON_ERROR(lRetVal);

	lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_SSID, strlen(pcSsidName),
			(unsigned char*)pcSsidName);
	ASSERT_ON_ERROR(lRetVal);

	UART_PRINT("Device is configured in AP mode\n\r");

	/* Restart Network processor */
	lRetVal = sl_Stop(SL_STOP_TIMEOUT);

	// reset status bits
	CLR_STATUS_BIT_ALL(g_ulStatus);

	return sl_Start(NULL,NULL,NULL);
}


//****************************************************************************
//
//!    \brief device will try to ping the machine that has just connected to the
//!           device.
//!
//!    \param  ulIpAddr is the ip address of the station which has connected to
//!            device
//!
//!    \return 0 if ping is successful, -1 for error
//
//****************************************************************************
void ControlLED(unsigned long ulIpAddr)
{  
	SlSockAddrIn_t  sAddr;
	SlSockAddrIn_t  sLocalAddr;
	int             iAddrSize;
	int				iSockID;
	int             iNewSockID;
	int             iStatus;
	int             iTestBufLen;

	char g_cBsdBuf[800];
	// filling the buffer
	memset(g_cBsdBuf,-1,sizeof(g_cBsdBuf));

	//关闭LED:
	GPIOPinWrite(GPIOA1_BASE, 0x2, 0);
	GPIOPinWrite(GPIOA1_BASE, 0x4, 0);
	GPIOPinWrite(GPIOA1_BASE, 0x8, 0);

	iTestBufLen  = 800;

	//filling the TCP server socket address
	sLocalAddr.sin_family = SL_AF_INET;
	sLocalAddr.sin_port = sl_Htons((unsigned short)5001);
	sLocalAddr.sin_addr.s_addr = 0;

	// creating a TCP socket
	iSockID = sl_Socket(SL_AF_INET,SL_SOCK_STREAM, 0);

	// binding the TCP socket to the TCP server address
	iStatus = sl_Bind(iSockID, (SlSockAddr_t *)&sLocalAddr, sizeof(SlSockAddrIn_t));

	Report("Listend to the port: 5001. \r\n");
	// putting the socket for listening to the incoming TCP connection
	iStatus = sl_Listen(iSockID, 0);

	UART_PRINT("Ready to accept connection. \r\n");


	iNewSockID = sl_Accept(iSockID, ( struct SlSockAddr_t *)&sAddr,
			(SlSocklen_t*)&iAddrSize);
	UART_PRINT("Connection is established.\r\n");
	//
	//draw standby page
	//
	fillScreen_a();
	drawString("Standby",0,100,5,GREEN);
	drawString("  >>>",0,180,5,GREEN);

	while (1)
	{
		iStatus = sl_Recv(iNewSockID, g_cBsdBuf, iTestBufLen, 0);

		if(g_cBsdBuf[0]=='1')   // start recording
		{
			GPIOPinWrite(GPIOA1_BASE, 0x2, 0x2);
			fillScreen_a();  //draw starting page
			drawString("Starting",0,100,4,YELLOW);
			drawString("  ...",0,180,5,YELLOW);

			UART_PRINT("recorder will start in a moment... \n\r");
			long lRetVal;
			unsigned char policyVal;
			long lFileHandle;
			unsigned long ulToken;
			if(RecordAndSave(&ulToken, &lFileHandle) < 0)  //jump to recorder
			    {
			        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
			        LOOP_FOREVER();
			    }
			//stanby page
			fillScreen_a();
			drawString("operation",0,100,4,GREEN);
			drawString(" success!",0,180,4,GREEN);
			osi_Sleep(1000);
			fillScreen_a();
			drawString("Standby",0,100,5,GREEN);
			drawString("  >>>",0,180,5,GREEN);
		}

		if(g_cBsdBuf[0]=='2')  // start sending file to PC via UART
		{
			GPIOPinWrite(GPIOA1_BASE, 0x2, 0);
			//UART_PRINT("RED LED OFF. \n\r");
			//draw sending
			fillScreen_a();
			drawString("Sending",0,100,4,RED);
			drawString("> > >",0,180,5,RED);
			long lRetVal;
			unsigned char policyVal;
			long lFileHandle;
			unsigned long ulToken;
			if(ReadFileFromDevice(ulToken, lFileHandle) < 0)
			{
				GPIO_IF_LedOn(MCU_RED_LED_GPIO);
				LOOP_FOREVER();
			}
			//standby page
			fillScreen_a();
			drawString("operation",0,100,4,GREEN);
			drawString(" success!",0,180,4,GREEN);
			osi_Sleep(1000);
			fillScreen_a();
			drawString("Standby",0,100,5,GREEN);
			drawString("  >>>",0,180,5,GREEN);

