Duuang/Recorder-and-Player-Application-on-CC3200/CC3200 Project/main.c
		}
		if(g_cBsdBuf[0]=='3')
		{
			GPIOPinWrite(GPIOA1_BASE, 0x4, 0x4);
			UART_PRINT("ORANGE LED ON. \n\r");
			fillScreen_a();
			drawTraingle(200, 100, 100, 100, 150, 200, GREEN);

		}
		if(g_cBsdBuf[0]=='4')
		{
			GPIOPinWrite(GPIOA1_BASE, 0x4, 0);
			UART_PRINT("ORANGE LED OFF. \n\r");
			fillScreen_a();
			fillRectangle(100, 100, 100, 100, RED);
		}
		if(g_cBsdBuf[0]=='5')
		{
			GPIOPinWrite(GPIOA1_BASE, 0x8, 0x8);
			UART_PRINT("GREEN LED ON. \n\r");
		}
		if(g_cBsdBuf[0]=='6')
		{
			GPIOPinWrite(GPIOA1_BASE, 0x8, 0);
			UART_PRINT("GREEN LED OFF. \n\r");
		}

		MAP_UtilsDelay(133333);//10ms
		UNUSED(iStatus);
		memset(g_cBsdBuf,-1,sizeof(g_cBsdBuf));
	}
	//iStatus = sl_Close(iNewSockID);
	//Report("Socket closed!\r\n");
}
//****************************************************************************
//
//!    \brief start simplelink, wait for the sta to connect to the device and 
//!        run the ping test for that sta
//!
//!    \param  pvparameters is the pointer to the list of parameters that can be
//!         passed to the task while creating it
//!
//!    \return None
//
//****************************************************************************
void WlanAPMode( void *pvParameters )
{   
	unsigned char ucDHCP;
	long lRetVal = -1;

	InitializeAppVariables();

	//
	// Following function configure the device to default state by cleaning
	// the persistent settings stored in NVMEM (viz. connection profiles &
	// policies, power policy etc)
	//
	// Applications may choose to skip this step if the developer is sure
	// that the device is in its default state at start of applicaton
	//
	// Note that all profiles and persistent settings that were done on the
	// device will be lost
	//
	lRetVal = ConfigureSimpleLinkToDefaultState();
	if(lRetVal < 0)
	{
		if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
			UART_PRINT("Failed to configure the device in its default state \n\r");

		LOOP_FOREVER();
	}

	UART_PRINT("Device is configured in default state \n\r");

	//
	// Asumption is that the device is configured in station mode already
	// and it is in its default state
	//
	lRetVal = sl_Start(NULL,NULL,NULL);

	if (lRetVal < 0)
	{
		UART_PRINT("Failed to start the device \n\r");
		LOOP_FOREVER();
	}

	UART_PRINT("Device started as STATION \n\r");

	//
	// Configure the networking mode and ssid name(for AP mode)
	//
	if(lRetVal != ROLE_AP)
	{
		if(ConfigureMode(lRetVal) != ROLE_AP)
		{
			UART_PRINT("Unable to set AP mode, exiting Application...\n\r");
			sl_Stop(SL_STOP_TIMEOUT);
			LOOP_FOREVER();
		}
	}

	while(!IS_IP_ACQUIRED(g_ulStatus))
	{
		//looping till ip is acquired
	}

	unsigned char len = sizeof(SlNetCfgIpV4Args_t);
	SlNetCfgIpV4Args_t ipV4 = {0};

	// get network configuration
	lRetVal = sl_NetCfgGet(SL_IPV4_AP_P2P_GO_GET_INFO,&ucDHCP,&len,
			(unsigned char *)&ipV4);
	if (lRetVal < 0)
	{
		UART_PRINT("Failed to get network configuration \n\r");
		LOOP_FOREVER();
	}

	UART_PRINT("Connect a client to Device\n\r");
	while(!IS_IP_LEASED(g_ulStatus))
	{
		//wating for the client to connect
	}
	UART_PRINT("Client is connected to Device\n\r");

	ControlLED(g_ulStaIp);

	UNUSED(ucDHCP);


	while(1);
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
	Report("\n\n\n\r");
	Report("\t\t *************************************************\n\r");
	Report("\t\t       CC3200 %s Application       \n\r", AppName);
	Report("\t\t *************************************************\n\r");
	Report("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
	/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
	//
	// Set vector table base
	//
#if defined(ccs) || defined(gcc)
	MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
	MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
	//
	// Enable Processor
	//
	MAP_IntMasterEnable();
	MAP_IntEnable(FAULT_SYSTICK);

	PRCMCC3200MCUInit();
}


//*****************************************************************************
//                            MAIN FUNCTION
//*****************************************************************************
void main()
{
	long lRetVal = -1;

	//
	// Board Initialization
	//
	BoardInit();

	//
	// Configure the pinmux settings for the peripherals exercised
	//
	PinMuxConfig();

#ifndef NOTERM
	//
	// Configuring UART
	//
	InitTerm();
#endif

	//
	// Display banner
	//
	DisplayBanner(APP_NAME);
	//
	//init LCD
	//
	SPI_begin();
	readID();
	TFTinit();//init TFT library

	//
	// Start the SimpleLink Host
	//
	lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
	if(lRetVal < 0)
	{
		ERR_PRINT(lRetVal);
		LOOP_FOREVER();
	}
	//
	// Start the WlanAPMode task
	//
	lRetVal = osi_TaskCreate( WlanAPMode, \
			(const signed char*)"wireless LAN in AP mode", \
			OSI_STACK_SIZE, NULL, 1, NULL );
	if(lRetVal < 0)
	{
		ERR_PRINT(lRetVal);
		LOOP_FOREVER();
	}
	//
	// Start the task scheduler
	//
	osi_start();
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
